Autodesk.Revit.DB.DetailCurveArray
An array that can contain any type of object.

Autodesk.Revit.DB.DetailCurveArray.Insert(System.Object,System.Int32)
System.Int32
Insert the specified item into the array.
item: The item to be inserted into the array.
index: The item will be inserted before this index.
Returns: Returns whether the item was inserted into the array.

Autodesk.Revit.DB.DetailCurveArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.DetailCurveArray.ReverseIterator
Autodesk.Revit.DB.DetailCurveArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.DetailCurveArray.ForwardIterator
Autodesk.Revit.DB.DetailCurveArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.DetailCurveArray.Append(System.Object)
void
Add the item to the end of the array.
item: The item to be added.

Autodesk.Revit.DB.DetailCurveArray.Clear
void
Removes every item from the array, rendering it empty.

Autodesk.Revit.DB.DetailCurveArray.Size
System.Int32
get
Returns the number of objects that are in the array.

Autodesk.Revit.DB.DetailCurveArray.Item(System.Int32)
System.Object
Gets or sets an item at a specified index within the array.
index: The index of the item to be set or retrieved.
Returns: Returns the object at the specified index.

Autodesk.Revit.DB.DetailCurveArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.